# 题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，
# 低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，
# 超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？

while True:
    profit = int(input('请输入利润值'))
    print("利润是 %d 万元" % profit)
    if profit <= 10:
        bonus = profit * 0.1
    elif profit > 10 and profit < 20:
        bonus = 10 * 0.1 + (profit - 10) * 0.075
    elif profit >= 20 and profit < 40:
        bonus = 10 * 0.1 + (20 - 10) * 0.075 + 0.05 * (profit - 20)
    elif profit >= 40 and profit < 60:
        bonus = 10 * 0.1 + (20 - 10) * 0.075 + 0.05 * (40 - 20) + 0.03 * (
            profit - 40)
    elif profit >= 60 and profit < 100:
        10 * 0.1 + (20 - 10) * 0.075 + 0.05 * (40 - 20) + 0.03 * (60 - 40) + (
            profit - 60) * 0.015
    else:
        bonus = 10 * 0.1 + (20 - 10) * 0.075 + 0.05 * (40 - 20) + 0.03 * (
            60 - 40) + (100 - 60) * 0.015 + (profit - 100) * 0.01

    print("奖金是 %d 万元" % profit)
